<template>
    <main>
      <div class="pb-4 text-center">
        <h2 class="font-patsy text-3xl text-white">Roadmap</h2>
      </div>
      <div class="roadmap-text">
        <h3>Q2-Q3 2024</h3>
        <p>1. Разработка концепции игрового процесса</p>
        <p>🟢 1.1 Определение принципов заработка игровых активов</p>
        <p>🟢 1.2 Разработка базового функционала игры</p>
        <p>🟢 1.3 Интеграция игровых механизмов </p>
        <p>🟢 1.4 Проведение закрытого бета-тестирования, сбор обратной связи, внесение корректив.</p>
        <h3>Q4 2024</h3>
        <p>2. Официальный запуск</p>
        <p>🔵 2.1 Анонсирование игры в телеграм на СНГ рынке</p>
        <p>🔵 2.2 Проведение маркетинговых компаний</p>
        <p>🔵 2.3 Анонсирование системы поощрения активных пользователей </p>
        <p>🔵 2.4 Окончание бета тестирования</p>
        <h3>Q1-Q2 2025</h3>
        <p>3. Внедрение механики внутриигрового вторичного рынка</p>
        <p>🔵 3.1 Маркетинговая компания</p>
        <p>🔵 3.2 Заключение партнерских соглашений с другими участниками P2E рынка</p>
        <h3>Q3 2025</h3>
        <p>4. Выпуск собственного токена</p>
        <p>🔵 4.1 Внедрение в игровые механики собственного токена </p>
        <p>🔵 4.2 Распределение токена среди активных пользователей.</p>
        <p>🔵 4.3 Создание уникальных игровых объектов в виде NFT</p>
        <p>🔵 4.4 Интеграция с существующими маркетплейсами.</p>
        <h3>Q4 2025</h3>
        <p>5. Выход на зарубежные рынки</p>
        <p>🔵 5.1 Проведение маркетинговых компаний </p>
        <h3>Q1 2026</h3>
        <p>6. Листинг токена</p>
        <p>🔵 6.1 Маркетинговая компания популизации собственного токена</p>
      </div>
    </main>
  </template>
  
  <script>
  export default {
    name: "RoadmapView",
    mounted() {
      let tg = window?.Telegram?.WebApp;
      tg.BackButton.show();
      tg.onEvent("backButtonClicked", this.goBack);
    },
    methods: {
      goBack() {
        this.$router.push("/info");
      },
    },
  };
  </script>
  
  <style lang="scss" scoped>
    .roadmap-text{
      padding: 0 20px 20px;
      h3{
        font-size: 18px;
        font-weight: 700;
        color: #fff;
        margin-top: 20px;
      }
    }
  </style>